
// оголошуємо змінну і присвоюємо їй значення "енергетичний напій"
let drink = "Energy drink";
// оголошуємо ще одну змінну і присвоюємо їй пустий рядок
let lyrics = "";
// оголошуємо треттю змінну і присвоюємо їй число
let cans = 6;


/* Цикл while говорить: "Поки кількість пляшок перевищує нуль - виконувати все,
що знаходиться в фігурних дужках. Коли пляшки закінчаться - вийти з циклу"*/
while (cans > 0) {
    /*Добавляємо наступний рядок пісні у змінну lyrics з використанням 
    оператора конкатинації рядків +. Зааершуємо рядок розривом рядка html */
    lyrics = lyrics + cans + " cans of " + drink + " on the wall <br> ";
    // Повторюємо
    lyrics = lyrics + cans + " cans of " + drink + " <br> ";
    // Повторюємо
    lyrics = lyrics + " Take one down, pass it around, <br> ";

    /*Якщо ще залишилися пляшки(Тобто більше ніж 1) */
    if (cans > 1) {
        // то добавити рядок
        lyrics = lyrics + (cans - 1) + " cans of " + drink + " on the wall <br> ";
        }

    // Інакше(якщо =1 ) 
    else {
        // Добавити рядок
        lyrics = lyrics + " No more cans of " + drink + " on the wall <br> "; 
    }
    // Зменшуємо кількість пляшок на 1
    cans = cans - 1;
}

/*Зберегли усі рядки пісні в змінній, тому тепер даємо сторінці команду записати її
Це означає, що рядок(ЗМІННА) буде добавлена на сторінку і можна побачити текст пісні*/
document.write(lyrics);